Revit 2024 API
PrimarySizeCriterion Class
 This class contains a size criterion for a RoutingPreferenceRule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class PrimarySizeCriterion : RoutingCriterionBase
Visual Basic
Public Class PrimarySizeCriterion _
	Inherits RoutingCriterionBase
Visual C++
public ref class PrimarySizeCriterion : public RoutingCriterionBase
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RoutingCriterionBase
 Autodesk.Revit.DB.PrimarySizeCriterion
See Also
PrimarySizeCriterion Members
Autodesk.Revit.DB Namespace